STMicroelectronics/OpenOCD/src/flash/nor/spc58xc.c
	return err;
}

static int spc58xc_getlock(struct flash_bank *bank,
		uint8_t block_space, uint32_t *lock_state)
{
	int err;
	struct target *target = bank->target;
	struct spc58xc_flash_bank *spc58xc_info = bank->driver_priv;
	struct working_area *ssd_config;

	struct working_area *getlock_working_area;

	struct working_area *getlock_algorithm;
	struct reg_param reg_params[5];
	struct powerpc_algorithm powerpc_info;
	SSD_CONFIG *ssd = &spc58xc_info->ssd;

	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _c55_ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
		return err;

	if (target_alloc_working_area(target, 4,
			&getlock_working_area) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do get lock working area allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	uint32_t tmp[1]={0};

	err = target_write_buffer(target, getlock_working_area->address,
			4, (uint8_t *)tmp);
	if (err != ERROR_OK)
		return err;


	/* Flash getlock code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_getlock_code),
			&getlock_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash erase step");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, getlock_working_area);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, getlock_algorithm->address,
			sizeof(spc58x_flash_getlock_code), (uint8_t *)spc58x_flash_getlock_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, getlock_algorithm);
		target_free_working_area(target, getlock_working_area);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);
	LOG_DEBUG("------> R3= 0x%08x",buf_get_u32(reg_params[0].value, 0, 32));

	init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
	buf_set_u32(reg_params[1].value, 0, 32, block_space);

	init_reg_param(&reg_params[2], "r5", 32, PARAM_OUT);
	buf_set_u32(reg_params[2].value, 0, 32, getlock_working_area->address);

	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[3], "lr", 32, PARAM_IN);
	buf_set_u32(reg_params[3].value, 0, 32, getlock_algorithm->address + (sizeof(spc58x_flash_getlock_code) - 2));

	init_reg_param(&reg_params[4], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[4].value, 0, 32, target->working_area_phys + target->working_area_size - 1);


	err = target_run_algorithm(target,
			0, NULL,
			5, reg_params,
			getlock_algorithm->address, (getlock_algorithm->address + getlock_algorithm->size),
			5000, &powerpc_info);

	if (err != ERROR_OK) {
		err = ERROR_TARGET_FAILURE;
		goto flash_getlock_error;
	}
#if 1
	if(buf_get_u32(reg_params[0].value, 0, 32) != 0)
	{
		err = ERROR_TARGET_FAILURE;
		LOG_INFO("Error 2: return value=0x%08x",buf_get_u32(reg_params[0].value, 0, 32));
		goto flash_getlock_error;
	}
#endif

	err = target_read_buffer(target, getlock_working_area->address,
			4, (uint8_t *)tmp);
	if (err != ERROR_OK) {
		goto flash_getlock_error;
	}


	/*  */
	*lock_state = fast_target_buffer_get_u32(&tmp[0], false);

	LOG_DEBUG("GetLock OK: return value (R3)=0x%08x lock_state=%d",buf_get_u32(reg_params[0].value, 0, 32), *lock_state);
flash_getlock_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);
	target_free_working_area(target, getlock_algorithm);
	target_free_working_area(target, getlock_working_area);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);

	return err;
}


static int spc58xc_erase(struct flash_bank *bank, unsigned int first, unsigned int last)
{

	unsigned int i;
	int err;
	struct target *target = bank->target;
	struct spc58xc_flash_bank *spc58xc_info = bank->driver_priv;
	struct working_area *ssd_config;
	struct working_area *erase_algorithm;
	struct working_area *erase_working_area;

	struct working_area *checkStatus_algorithm;
	struct working_area *checkStatus_working_area;
	struct working_area *checkStatus_working_area_CtxData;

	struct reg_param reg_params[8];
	struct powerpc_algorithm powerpc_info;

	uint32_t opResult;
	uint32_t opReturn;


	SSD_CONFIG *ssd = &spc58xc_info->ssd;

	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	uint32_t low_mask = 0;
	uint32_t mid_mask = 0;
	uint32_t high_mask = 0;
	NLARGE_BLOCK_SEL nLargeBlockSelect;
	nLargeBlockSelect.firstLargeBlockSelect = 0;
	nLargeBlockSelect.secondLargeBlockSelect = 0;
	uint32_t firstLargeBlockSelect = 0;
	uint32_t secondLargeBlockSelect = 0;


	uint8_t LOW_LOCK_SEL_CODE[8] = {3, 1, 4, 2, 6, 7, 8, 9};
	// uint8_t LARGE_LOCK_SEL_CODE[8] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15};
	uint8_t LOW_LOCK_SEL_SECURITY[3]= {5, 10, 11};

	if (bank->base == 0xFC0000)
	{
		for (i = first; i <= last; i++) {
			if (i < spc58xc_info->low_max_index) {
				low_mask |= (1 << LOW_LOCK_SEL_CODE[i]);
			} else if (i < spc58xc_info->large_max_index) {
				nLargeBlockSelect.firstLargeBlockSelect |= (1 << (i - spc58xc_info->low_max_index));
			}
		}
	}
	else if (bank->base == 0x60C000)
	{
		for (i = first; i <= last; i++) {
			low_mask |= (1 << LOW_LOCK_SEL_SECURITY[i]);
		}
	}
	else if (bank->base == 0x680000)
	{
		for (i = first; i <= last; i++) {
			if (i < spc58xc_info->mid_max_index) {
				mid_mask |= (1 << i);
			}
		}
	}
	else if (bank->base == 0x800000)
	{
		for (i = first; i <= last; i++) {
			if (i < spc58xc_info->high_max_index) {
				high_mask |= (1 << i);
			}
		}
	}


	/* unlock flash registers */
	uint32_t lock_state;

	if (low_mask != 0) {
		err = spc58xc_getlock(bank, C55_BLOCK_LOW, &lock_state);
		if (err != ERROR_OK)
			return err;

