STMicroelectronics/OpenOCD/src/flash/nor/spc58xc.c
		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[6], "lr", 32, PARAM_IN);	/* lr */
		buf_set_u32(reg_params[6].value, 0, 32, write_algorithm->address +(sizeof(spc58x_flash_write_code) - 2));

		init_reg_param(&reg_params[7], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[7].value, 0, 32, 0x400AFFFF);


		err = target_run_algorithm(target,
				0, NULL,
				8, reg_params,
				write_algorithm->address, (write_algorithm->address + write_algorithm->size),
				5000, &powerpc_info);

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);
		destroy_reg_param(&reg_params[7]);


		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);

			goto flash_write_error;
		}

/* Check Status */
		opResult=0;
		opReturn=C55_INPROGRESS;

		while (opReturn == C55_INPROGRESS)
		{
			/* ssd_config (in), return value (out) */
			init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
			buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

			/* modeOp C55_MODE_OP_ERASE (0x1) */
			init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
			buf_set_u32(reg_params[1].value, 0, 32, C55_MODE_OP_PROGRAM);

			/* opResult */
			init_reg_param(&reg_params[2], "r5", 32, PARAM_IN_OUT);
			buf_set_u32(reg_params[2].value, 0, 32, checkStatus_working_area->address);

			init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
			buf_set_u32(reg_params[3].value, 0, 32, write_working_area_CtxData->address);

			/*
			 * Link register (in).
			 * Set link register to the breakpoint instruction at the end of the buffer.
			 * We use a software breakpoint to notify when done with algorithm execution.
			 */
			init_reg_param(&reg_params[4], "lr", 32, PARAM_IN);
			buf_set_u32(reg_params[4].value, 0, 32, checkStatus_algorithm->address + (sizeof(spc58x_flash_CheckStatus_code) - 2));

			init_reg_param(&reg_params[5], "r1", 32, PARAM_IN);
			buf_set_u32(reg_params[5].value, 0, 32, 0x400AFFFF);


			err = target_run_algorithm(target,
					0, NULL,
					6, reg_params,
					checkStatus_algorithm->address, (checkStatus_algorithm->address + checkStatus_algorithm->size),
					2000000000, &powerpc_info);


			if (err != ERROR_OK)  {
				err = ERROR_TARGET_FAILURE;
				target_free_working_area(target, write_algorithm);
				target_free_working_area(target, source);
				target_free_working_area(target, write_working_area_CtxData);
				target_free_working_area(target, checkStatus_algorithm);
				target_free_working_area(target, checkStatus_working_area);

				destroy_reg_param(&reg_params[0]);
				destroy_reg_param(&reg_params[1]);
				destroy_reg_param(&reg_params[2]);
				destroy_reg_param(&reg_params[3]);
				destroy_reg_param(&reg_params[4]);
				destroy_reg_param(&reg_params[5]);

				goto flash_write_error;
			}

			opReturn = buf_get_u32(reg_params[0].value, 0, 32);
		}

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
	}

	if(bytes_remain)
	{

		err = target_write_buffer(target, source->address,
				bytes_remain, (uint8_t *)(buffer  + (i * chunk_size)));
		if (err != ERROR_OK) {
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			return err;
		}



		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

		/* factoryPgmFlag  - FALSE to do normal program. */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, 0);

		/* dest */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
		buf_set_u32(reg_params[2].value, 0, 32, bank->base + offset + (i * chunk_size));

		/* size */
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
		buf_set_u32(reg_params[3].value, 0, 32, bytes_remain);

		init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);	/* source */
		buf_set_u32(reg_params[4].value, 0, 32, source->address);

		init_reg_param(&reg_params[5], "r8", 32, PARAM_IN);
		buf_set_u32(reg_params[5].value, 0, 32, write_working_area_CtxData->address);

		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[6], "lr", 32, PARAM_IN);	/* lr */
		buf_set_u32(reg_params[6].value, 0, 32, write_algorithm->address +(sizeof(spc58x_flash_write_code) - 2));

		init_reg_param(&reg_params[7], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[7].value, 0, 32, 0x400AFFFF);

		err = target_run_algorithm(target,
				0, NULL,
				8, reg_params,
				write_algorithm->address, (write_algorithm->address + write_algorithm->size),
				5000, &powerpc_info);

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);
		destroy_reg_param(&reg_params[7]);

		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			goto flash_write_error;
		}

/* Check Status */
		opResult=0;
		opReturn=C55_INPROGRESS;

		while (opReturn == C55_INPROGRESS)
		{
			/* ssd_config (in), return value (out) */
			init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
			buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

