STMicroelectronics/OpenOCD/src/flash/nor/spc58xc.c
/*	err = target_write_buffer(target, write_working_area_CtxData->address,
			sizeof(CONTEXT_DATA), (uint8_t *)&pgmCtxData);


	err = powerpc_write_memory_noturn(target, write_working_area_CtxData->address + 32,
			4, (uint8_t *)&write_algorithm->address);
*/
	err = target_write_buffer(target, write_working_area_CtxData->address + 32,
				32, (uint8_t *)&loc_func);

	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		return err;
	}

	/* Flash checkStatus code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_CheckStatus_code),
				&checkStatus_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash check status during erase step");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
    	target_free_working_area(target, source);
	    target_free_working_area(target, write_working_area_CtxData);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, checkStatus_algorithm->address,
				sizeof(spc58x_flash_CheckStatus_code), (uint8_t *)spc58x_flash_CheckStatus_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		target_free_working_area(target, checkStatus_algorithm);
		return err;
	}

	/* opResult */
	if (target_alloc_working_area(target, 4,
			&checkStatus_working_area) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do get lock working area allocation");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		target_free_working_area(target, checkStatus_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	opResult = 0;
	err = target_write_buffer(target, checkStatus_working_area->address,
			4, (uint8_t *)&opResult);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		target_free_working_area(target, checkStatus_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	for(i = 0; i < chunk_number; i++)
	{

		err = target_write_buffer(target, source->address,
				size, (uint8_t *)(buffer  + (i * chunk_size)));
		if (err != ERROR_OK) {
			target_free_working_area(target, ssd_config);
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			return err;
		}

		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

		/* factoryPgmFlag  - FALSE to do normal program. */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, 0);

		/* dest */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
		buf_set_u32(reg_params[2].value, 0, 32, bank->base + offset + (i * chunk_size));
		/* buf_set_u32(reg_params[2].value, 0, 32, 0xFC0000); */

		/* size */
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);	/* size = 0x200 */
		buf_set_u32(reg_params[3].value, 0, 32, size);

		init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);	/* source */
		buf_set_u32(reg_params[4].value, 0, 32, source->address);

		init_reg_param(&reg_params[5], "r8", 32, PARAM_IN);
		buf_set_u32(reg_params[5].value, 0, 32, write_working_area_CtxData->address);


		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[6], "lr", 32, PARAM_IN);	/* lr */
		buf_set_u32(reg_params[6].value, 0, 32, write_algorithm->address +(sizeof(spc58x_flash_write_code) - 2));

		init_reg_param(&reg_params[7], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[7].value, 0, 32, target->working_area_phys + target->working_area_size - 1);


		err = target_run_algorithm(target,
				0, NULL,
				8, reg_params,
				write_algorithm->address, (write_algorithm->address + write_algorithm->size),
				2000000000, &powerpc_info);

		LOG_DEBUG("Device buffer Size: %d, Number of iteraction: %d, Current iteraction: %d, err: %d", chunk_size, chunk_number, i, err);

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);
		destroy_reg_param(&reg_params[7]);


		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);

			goto flash_write_error;
		}

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
	}

	if(bytes_remain)
	{

		err = target_write_buffer(target, source->address,
				bytes_remain, (uint8_t *)(buffer  + (i * chunk_size)));
		if (err != ERROR_OK) {
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			return err;
		}



