STMicroelectronics/OpenOCD/src/flash/nor/spc58xc.c
		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

		/* factoryPgmFlag  - FALSE to do normal program. */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, 0);

		/* dest */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
		buf_set_u32(reg_params[2].value, 0, 32, bank->base + offset + (i * chunk_size));

		/* size */
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
		buf_set_u32(reg_params[3].value, 0, 32, bytes_remain);

		init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);	/* source */
		buf_set_u32(reg_params[4].value, 0, 32, source->address);

		init_reg_param(&reg_params[5], "r8", 32, PARAM_IN);
		buf_set_u32(reg_params[5].value, 0, 32, write_working_area_CtxData->address);

		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[6], "lr", 32, PARAM_IN);	/* lr */
		buf_set_u32(reg_params[6].value, 0, 32, write_algorithm->address +(sizeof(spc58x_flash_write_code) - 2));

		init_reg_param(&reg_params[7], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[7].value, 0, 32, target->working_area_phys + target->working_area_size - 1);

		err = target_run_algorithm(target,
				0, NULL,
				8, reg_params,
				write_algorithm->address, (write_algorithm->address + write_algorithm->size),
				5000, &powerpc_info);

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);
		destroy_reg_param(&reg_params[7]);

		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			goto flash_write_error;
		}
	}

	err = target_read_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);

	if (err != ERROR_OK)
	{
		err = ERROR_TARGET_FAILURE;
	}

	target_free_working_area(target, source);
	target_free_working_area(target, write_algorithm);
	target_free_working_area(target, write_working_area_CtxData);
	target_free_working_area(target, checkStatus_algorithm);
	target_free_working_area(target, checkStatus_working_area);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);
	destroy_reg_param(&reg_params[5]);


flash_write_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);

	return err;
}


static void setup_sector(struct flash_bank *bank, unsigned int start, unsigned int num, unsigned int size)
{
	unsigned int i;
	for (i = start; i < (start + num) ; i++) {
		assert(i < bank->num_sectors);
		bank->sectors[i].offset = bank->size;
		bank->sectors[i].size = size;
		bank->size += bank->sectors[i].size;
	}
}

static int spc58xc_probe(struct flash_bank *bank)
{
	struct spc58xc_flash_bank *spc58xc_info = bank->driver_priv;
	struct target *target = bank->target;
	struct working_area *ssd_config;
	struct working_area *init_algorithm;
	struct reg_param reg_params[3];
	struct powerpc_algorithm powerpc_info;
	SSD_CONFIG *ssd = &spc58xc_info->ssd;


	int i;
	int err;
	uint16_t flash_size_in_kb = 0;

	int num_pages;

	num_pages = 0;

	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);

	spc58xc_info->probed = 0;

	/* The user sets the size manually */
	if (spc58xc_info->user_bank_size) {
		LOG_DEBUG("ignoring flash probed value, using configured bank size");
		flash_size_in_kb = spc58xc_info->user_bank_size / 1024;
	}

	LOG_INFO("flash: %d kbytes @ 0x%08x", flash_size_in_kb, spc58xc_info->user_bank_addr);


	/* did we assign flash size? */
	assert(flash_size_in_kb != 0xffff);

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _c55_ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	/* Default SSD values (keep them in target endianess) */
	uint32_t val;
	val = C55_REG_BASE;
    ssd->c55RegBase = fast_target_buffer_get_u32(&val, false);

    val = MAIN_ARRAY_BASE;
	ssd->mainArrayBase = fast_target_buffer_get_u32(&val, false);

    val = UTEST_ARRAY_BASE;
	ssd->uTestArrayBase = fast_target_buffer_get_u32(&val, false);

	val = C55_PROGRAMMABLE_SIZE;
	ssd->programmableSize = fast_target_buffer_get_u32(&val, false);


	ssd->lowBlockInfo.n16KBlockNum = 0;
	ssd->lowBlockInfo.n32KBlockNum = 0;
	ssd->lowBlockInfo.n64KBlockNum = 0;
	ssd->lowBlockInfo.n128KBlockNum = 0;

	ssd->midBlockInfo.n16KBlockNum = 0;
	ssd->midBlockInfo.n32KBlockNum = 0;
	ssd->midBlockInfo.n64KBlockNum = 0;
	ssd->midBlockInfo.n128KBlockNum = 0;

	ssd->highBlockInfo.n16KBlockNum = 0;
	ssd->highBlockInfo.n32KBlockNum = 0;
	ssd->highBlockInfo.n64KBlockNum = 0;
	ssd->highBlockInfo.n128KBlockNum = 0;

	ssd->nLargeBlockNum = 0;

	ssd->mainInterfaceFlag = 1;

	ssd->BDMEnable = 0;

	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
	{
		target_free_working_area(target, ssd_config);
		return err;
	}


	/* Flash initialization code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_init_code),
			&init_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash init step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, init_algorithm->address,
			sizeof(spc58x_flash_init_code), (uint8_t *)spc58x_flash_init_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, init_algorithm);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

