STMicroelectronics/OpenOCD/src/flash/nor/spc58xc.c
	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[1], "lr", 32, PARAM_IN);
	//buf_set_u32(reg_params[1].value, 0, 32, init_algorithm->address + (init_algorithm->size - 2));
	buf_set_u32(reg_params[1].value, 0, 32, init_algorithm->address + (sizeof(spc58x_flash_init_code) - 2));
	//buf_set_u32(reg_params[1].value, 0, 32, 0x400a8164);

	/*
	* Stack Pointer (in).
	*/
	init_reg_param(&reg_params[2], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[2].value, 0, 32, target->working_area_phys + target->working_area_size - 1);

	err = target_run_algorithm(target,
			0, NULL,
			3, reg_params,
			init_algorithm->address, (init_algorithm->address + init_algorithm->size),
			5000, &powerpc_info);

	if ((err != ERROR_OK) || (buf_get_u32(reg_params[0].value, 0, 32) != 0)) {
		err = ERROR_TARGET_FAILURE;
		goto flash_init_error;
	}

	err = target_read_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK) {
		goto flash_init_error;
	}

	LOG_DEBUG("SDD->c55RegBase  = 0x%08x", fast_target_buffer_get_u32(&ssd->c55RegBase, false));
	LOG_DEBUG("SDD->mainArrayBase = 0x%08x", fast_target_buffer_get_u32(&ssd->mainArrayBase, false));
	LOG_DEBUG("SDD->uTestArrayBase = 0x%08x", fast_target_buffer_get_u32(&ssd->uTestArrayBase, false));

	LOG_DEBUG("SDD->lowBlockInfo->n16KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n16KBlockNum, false));
	LOG_DEBUG("SDD->lowBlockInfo->n32KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n32KBlockNum, false));
	LOG_DEBUG("SDD->lowBlockInfo->n64KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n64KBlockNum, false));
	LOG_DEBUG("SDD->lowBlockInfo->n128KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockInfo.n128KBlockNum, false));

	LOG_DEBUG("SDD->midBlockInfo->n16KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n16KBlockNum, false));
	LOG_DEBUG("SDD->midBlockInfo->n32KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n32KBlockNum, false));
	LOG_DEBUG("SDD->midBlockInfo->n64KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n64KBlockNum, false));
	LOG_DEBUG("SDD->midBlockInfo->n128KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockInfo.n128KBlockNum, false));

	LOG_DEBUG("SDD->highBlockInfo->n16KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n16KBlockNum, false));
	LOG_DEBUG("SDD->highBlockInfo->n32KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n32KBlockNum, false));
	LOG_DEBUG("SDD->highBlockInfo->n64KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n64KBlockNum, false));
	LOG_DEBUG("SDD->highBlockInfo->n128KBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockInfo.n128KBlockNum, false));


	LOG_DEBUG("SDD->nLargeBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->nLargeBlockNum, false));

	LOG_DEBUG("SDD->mainInterfaceFlag  = 0x%u", ssd->mainInterfaceFlag);
	LOG_DEBUG("SDD->programmableSize   = 0x%08x", fast_target_buffer_get_u32(&ssd->programmableSize, false));
	LOG_DEBUG("SDD->BDMEnable     = 0x%u", ssd->BDMEnable);


	/* calculate numbers of pages */
	/* int num_pages = fast_target_buffer_get_u32(&ssd->lowBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n128KBlockNum, false);
	num_pages = num_pages + fast_target_buffer_get_u32(&ssd->midBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n128KBlockNum, false);
	num_pages = num_pages + fast_target_buffer_get_u32(&ssd->highBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n128KBlockNum, false);
	num_pages = num_pages + fast_target_buffer_get_u32(&ssd->nLargeBlockNum, false);
	*/
	if(bank->base == 0xFC0000)
	{
		num_pages = 24;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc58xc_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 4, 16 * 1024);
		setup_sector(bank, 4, 2, 32 * 1024);
		setup_sector(bank, 6, 2, 64 * 1024);

		// Large Flash Blocks
		setup_sector(bank, 8, 2, 128 * 1024);
		setup_sector(bank, 10, 14, 256 * 1024);

		spc58xc_info->low_max_index = 8;
		spc58xc_info->large_max_index = 24;
		spc58xc_info->high_max_index = 0;
		spc58xc_info->mid_max_index = 0;
	}
	else if(bank->base == 0x60C000)
	{
		num_pages = 3;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc58xc_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 1, 16 * 1024);
		setup_sector(bank, 1, 2, 64 * 1024);


		spc58xc_info->low_max_index = 3;
		spc58xc_info->large_max_index = 0;
		spc58xc_info->high_max_index = 0;
		spc58xc_info->mid_max_index = 0;
	}
	else if(bank->base == 0x680000)
		{
			num_pages = 2;

			/* check that calculation result makes sense */
			assert(num_pages > 0);

			if (bank->sectors) {
				free(bank->sectors);
				bank->sectors = NULL;
			}

			bank->base = spc58xc_info->user_bank_addr;
			bank->num_sectors = num_pages;
			bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
			bank->size = 0;

			// Mid Flash Blocks
			setup_sector(bank, 0, 2, 16 * 1024);


			spc58xc_info->low_max_index = 0;
			spc58xc_info->large_max_index = 0;
			spc58xc_info->high_max_index = 0;
			spc58xc_info->mid_max_index = 2;
		}
	else if(bank->base == 0x800000)
	{
		num_pages = 4;

