STMicroelectronics/OpenOCD/src/flash/nor/spc58xc.c
		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc58xc_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 4, 32 * 1024);

		spc58xc_info->low_max_index = 0;
		spc58xc_info->large_max_index = 0;
		spc58xc_info->high_max_index = 4;
		spc58xc_info->mid_max_index = 0;
	}



	for (i = 0; i < num_pages; i++) {
		bank->sectors[i].is_erased = -1;
		bank->sectors[i].is_protected = 0;
	}


	/* Save flash geometry (in sectors) */
/*
	spc58xc_info->low_max_index = fast_target_buffer_get_u32(&ssd->lowBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n128KBlockNum, false);
	spc58xc_info->large_max_index = spc58xc_info->low_max_index +  fast_target_buffer_get_u32(&ssd->nLargeBlockNum, false);
	spc58xc_info->high_max_index = spc58xc_info->large_max_index + fast_target_buffer_get_u32(&ssd->highBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n128KBlockNum, false);
	spc58xc_info->mid_max_index = spc58xc_info->high_max_index + fast_target_buffer_get_u32(&ssd->midBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n128KBlockNum, false);
*/



	/* Done */
	spc58xc_info->probed = 1;


flash_init_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);
	target_free_working_area(target, init_algorithm);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);

	return err;
}

static int spc58xc_auto_probe(struct flash_bank *bank)
{
	struct spc58xc_flash_bank *spc58xc_info = bank->driver_priv;

	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	if (spc58xc_info->probed)
		return ERROR_OK;
	return spc58xc_probe(bank);
}


static int get_spc58xc_info(struct flash_bank *bank, struct command_invocation *cmd)
{
	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	/* TODO: retrieve the right info */
	//snprintf(buf, buf_size, "SPC560B - Rev: xx");

	return ERROR_OK;
}


struct flash_driver spc58xc_flash = {
	.name = "spc58xc",
	.flash_bank_command = spc58xc_flash_bank_command,
	.erase = spc58xc_erase,
	.protect = spc58xc_protect,
	.write = spc58xc_write,
	.read = default_flash_read,
	.probe = spc58xc_probe,
	.auto_probe = spc58xc_auto_probe,
	.erase_check = default_flash_blank_check,
	.protect_check = spc58xc_protect_check,
	.info = get_spc58xc_info,
};
